1. Some values in the the FlightNumber column are missing. These numbers are
meant to increase by 10 with each row so 10055 and 10075 need to be put in
place. Fill in these missing numbers and make the column an integer column
(instead of a float column).

In [10]:
import numpy as np
import pandas as pd

df = pd.DataFrame({'From_To': ['London_paris', 'Madrid_milan', 'londON_Stockholm',
'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})
df

            From_To  FlightNumber  RecentDelays              Airline
0      London_paris       10045.0      [23, 47]               KLM(!)
1      Madrid_milan           NaN            []    <Air France> (12)
2  londON_Stockholm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [11]:
df['FlightNumber']

0    10045.0
1        NaN
2    10065.0
3        NaN
4    10085.0
Name: FlightNumber, dtype: float64

2.The From_To column would be better as two separate columns! Split each
string on the underscore delimiter _ to give a new temporary DataFrame with
the correct values. Assign the correct column names to this temporary
DataFrame.

In [13]:
newindex=np.arange(1,df.From_To.count()+1)
newindex
df.set_index(newindex, inplace=True)
df

            From_To  FlightNumber  RecentDelays              Airline
1      London_paris       10045.0      [23, 47]               KLM(!)
2      Madrid_milan           NaN            []    <Air France> (12)
3  londON_Stockholm       10065.0  [24, 43, 87]  (British Airways. )
4    Budapest_PaRis           NaN          [13]       12. Air France
5   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

3. Notice how the capitalisation of the city names is all mixed up in this
temporary DataFrame. Standardise the strings so that only the first letter is
uppercase (e.g. "londON" should become "London".)

In [23]:
for i in np.arange(1,df.From_To.count()+1):
 if pd.isnull(df.FlightNumber.loc[i,]):
    df.loc[i,'FlightNumber'] = df.FlightNumber.loc[i-1] + 10
df['FlightNumber']
df

            From_To  FlightNumber  RecentDelays              Airline
1      London_paris       10045.0      [23, 47]               KLM(!)
2      Madrid_milan       10055.0            []    <Air France> (12)
3  londON_Stockholm       10065.0  [24, 43, 87]  (British Airways. )
4    Budapest_PaRis       10075.0          [13]       12. Air France
5   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

4. Delete the From_To column from df and attach the temporary DataFrame
from the previous questions.

In [24]:
df['FlightNumber'].astype(int)

1    10045
2    10055
3    10065
4    10075
5    10085
Name: FlightNumber, dtype: int32

5. In the RecentDelays column, the values have been entered into the
DataFrame as a list. We would like each first value in its own column, each

second value in its own column, and so on. If there isn't an Nth value, the value
should be NaN.
Expand the Series of lists into a DataFrame named delays, rename the columns
delay_1, delay_2, etc. and replace the unwanted RecentDelays column in df
with delays.
Note: Solution submitted

In [25]:
df['From_To']

1        London_paris
2        Madrid_milan
3    londON_Stockholm
4      Budapest_PaRis
5     Brussels_londOn
Name: From_To, dtype: object

In [26]:
temporarydf = df.copy()
temporarydf[['From','To']] = temporarydf.From_To.str.split("_",expand=True)
temporarydf

,From_To,FlightNumber,RecentDelays,Airline,From,To
1,London_paris,10045.0,"[23, 47]",KLM(!),London,paris
2,Madrid_milan,10055.0,[],<Air France> (12),Madrid,milan
3,londON_Stockholm,10065.0,"[24, 43, 87]",(British Airways. ),londON,Stockholm
4,Budapest_PaRis,10075.0,[13],12. Air France,Budapest,PaRis
5,Brussels_londOn,10085.0,"[67, 32]","""Swiss Air""",Brussels,londOn